# Sakila Core

## Sakila's Model
![png](Data/sakila-db-model.png)

## SQL Alchemy and Pandas Prep

In [6]:
# imports
import pandas as pd
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

In [8]:
# accessing mysql workbench in sakila db
connection = f'mysql+pymysql://{username}:{password}@localhost/sakila'
engine = create_engine(connection)

In [9]:
# running engine
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [10]:
# showing the tables in sakila
q = '''SHOW TABLES'''
pd.read_sql(q,engine)

              Tables_in_sakila
0                        actor
1                   actor_info
2                      address
3                     category
4                         city
5                      country
6                     customer
7                customer_list
8                         film
9                   film_actor
10               film_category
11                   film_list
12                   film_text
13                   inventory
14                    language
15  nicer_but_slower_film_list
16                     payment
17                      rental
18      sales_by_film_category
19              sales_by_store
20                       staff
21                  staff_list
22                       store

# 1. What query would you run to get all the customers inside city_id = 312?  Your query should return the customers' first name, last name, email, address, and city.

In [23]:
q1 = '''
SELECT
    c.city,
    a.address, 
    cust.first_name,
    cust.last_name,
    cust.email
FROM
    city c
JOIN 
    address a ON c.city_id = a.city_id
JOIN 
    customer cust ON a.address_id = cust.address_id
WHERE
    c.city_id = 312
'''

pd.read_sql(q1,engine)

,city,address,first_name,last_name,email
0,London,1497 Yuzhou Drive,MATTIE,HOFFMAN,MATTIE.HOFFMAN@sakilacustomer.org
1,London,548 Uruapan Street,CECIL,VINES,CECIL.VINES@sakilacustomer.org

# 2. What query would you run to get all comedy films? Note that the genre is called the category in this schema.  Your query should return film title, description, release year, rating, and special features.

In [25]:
q2 = '''
SELECT
	c.name,
	f.title,
    f.description,
    f.release_year,
    f.rating,
    f.special_features
FROM
	film f
JOIN
	film_category fc ON f.film_id = fc.film_id
JOIN
	category c ON fc.category_id = c.category_id
WHERE
	c.name = 'Comedy'
'''

pd.read_sql(q2,engine).head()

,name,title,description,release_year,rating,special_features
0,Comedy,AIRPLANE SIERRA,A Touching Saga of a Hunter And a Butler who m...,2006,PG-13,"Trailers,Deleted Scenes"
1,Comedy,ANTHEM LUKE,A Touching Panorama of a Waitress And a Woman ...,2006,PG-13,"Deleted Scenes,Behind the Scenes"
2,Comedy,BRINGING HYSTERICAL,A Fateful Saga of a A Shark And a Technical Wr...,2006,PG,Trailers
3,Comedy,CAPER MOTIONS,A Fateful Saga of a Moose And a Car who must P...,2006,G,"Trailers,Commentaries,Deleted Scenes"
4,Comedy,CAT CONEHEADS,A Fast-Paced Panorama of a Girl And a A Shark ...,2006,G,"Commentaries,Deleted Scenes"

# 3. What query would you run to get all the films that Johnny Lollobrigida was in? Your query should return the actor's last name, film title, and release year.

In [27]:
q3 = '''
SELECT
	a.last_name,
    f.title,
    f.release_year
FROM 
	film f
JOIN 
	film_actor fa ON f.film_id = fa.film_id
JOIN
	actor a ON fa.actor_id = a.actor_id
WHERE
	a.last_name = "LOLLOBRIGIDA"
'''
pd.read_sql(q3,engine).head()

      last_name                 title  release_year
0  LOLLOBRIGIDA          AMADEUS HOLY          2006
1  LOLLOBRIGIDA      BANGER PINOCCHIO          2006
2  LOLLOBRIGIDA      BONNIE HOLOCAUST          2006
3  LOLLOBRIGIDA           CHITTY LOCK          2006
4  LOLLOBRIGIDA  COMMANDMENTS EXPRESS          2006

# 4. What query would you run to get the first and last names of all the actors in the movie titled "Bingo Talented"?

In [28]:
q4 = '''
SELECT
	f.title,
    a.first_name,
    a.last_name
FROM 
	film f
JOIN 
	film_actor fa ON f.film_id = fa.film_id
JOIN
	actor a ON fa.actor_id = a.actor_id
WHERE
	f.title = "Bingo Talented"
'''
pd.read_sql(q4,engine).head()

            title first_name    last_name
0  BINGO TALENTED     GOLDIE        BRODY
1  BINGO TALENTED    CAMERON         WRAY
2  BINGO TALENTED       CARY  MCCONAUGHEY
3  BINGO TALENTED        JON        CHASE
4  BINGO TALENTED      RENEE         BALL

# 5.  What query would you run to get the customer_id associated with all payments greater than twice the average payment amount? (HINT: use 2* in your query to get twice the amount). Your result should include the customer id and the amount.

In [29]:
q5 = '''
SELECT 
	customer_id,
    amount
FROM
    payment
WHERE
    amount > 
		(SELECT 
            AVG(amount) * 2
        FROM
            payment)
'''
pd.read_sql(q5,engine).head()

   customer_id  amount
0            1    9.99
1            2   10.99
2            3    8.99
3            3   10.99
4            3    8.99

# 6. What query would you run to list the first and last names of the 5 customers who have the highest number(count) of payments? You can title the number of payments as num_payments.

In [30]:
q6 = '''
SELECT 
    c.first_name, 
	c.last_name, COUNT(p.amount) as num_payments
FROM
	customer c
JOIN
	payment p ON c.customer_id = p.customer_id
GROUP BY
	c.customer_id
ORDER BY
	num_payments DESC
LIMIT 5
'''
pd.read_sql(q6,engine)

  first_name last_name  num_payments
0    ELEANOR      HUNT            46
1       KARL      SEAL            45
2     MARCIA      DEAN            42
3      CLARA      SHAW            42
4      TAMMY   SANDERS            41